/* Ruler 1         2         3         4         5         6         7        */

/******************************************************************************/
/*                                                                            */
/*   IMPLEMENTACIÓN DE FUNCIONES PARA DIBUJAR LA NAVE EN BLANCO               */
/*                                                                            */
/******************************************************************************/

#include <stdio.h>
#include "ovni_data.h"
#include "ovni_draw.h"
#include "conio.h"  

/******************************************************************************/
/*                           COLORES ANSI                                     */
/******************************************************************************/

#define RESET "\033[0m"
#define MAGENTA "\033[35m"


/******************************************************************************/
/*                     FUNCIÓN PARA DIBUJAR NAVE                              */
/******************************************************************************/

/* Dibujar Nave (Magenta) */
void draw_ovni(int x, int y) {
    for (int i = 0; i < 4; i++) {
        gotoxy(x, y + i); 
        printf("%s%s%s", MAGENTA, ovni_e[i], RESET);
    }
}